#+TITLE: TensorFlow Tutorial #11

*** why using cross-entropy
We have also added a new loss or cost-function to the graph, that calculates the
so-called cross-entropy, which is a measure of:

#+BEGIN_QUOTE
*how well the Inception model has performed at classifying the noisy image*.
#+END_QUOTE

Because the Inception model is constructed from many basic mathematical
operations that have been combined, TensorFlow allows us to easily find the
gradient of the loss-function using the chain-rule of differentiation.

We use the gradient of the loss-function with regard to the input-image, to
guide us when searching for the adversarial noise.

#+BEGIN_QUOTE
*We are looking for noise that increases the classification score (aka. probability) for 'bookcase' rather than the original classification of the input image*.
#+END_QUOTE

This essentially performs optimization using gradient descent and is implemented
further below.

#+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
from IPython.display import Image, display
Image('images/11_adversarial_examples_flowchart.png')
#+END_SRC

#+RESULTS:
:RESULTS:
6 - f2d039ee-6e7d-4224-bb02-9ff3c3b56c04
:END:

